# Imports

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('fivethirtyeight')

# Read from .csv File

In [17]:
gpa_df = pd.read_csv('./data/gpa.csv')

In [18]:
gpa_df

     name gender  grade   gpa
0     Bob      m     11  4.21
1     Sam      m     12  3.82
2    Jane      f     10  3.98
3   Kelly      f     12  4.30
4    Mark      m      8  3.56
5  Hannah      f     12  4.11
6    Mary      f     10  3.75
7   Erica      f      9  3.88

In [19]:
gpa_df.describe()

           grade       gpa
count   8.000000  8.000000
mean   10.500000  3.951250
std     1.511858  0.247988
min     8.000000  3.560000
25%     9.750000  3.802500
50%    10.500000  3.930000
75%    12.000000  4.135000
max    12.000000  4.300000

# Load Using Dictionary

In [20]:
dict_gpa = {'name': ['Bob', 'Sam', 'Jane', 'Kelly', 'Mark', 'Hannah', 'Mary', 'Erica']
            , 'gender': ['m', 'm', 'f', 'f', 'm', 'f', 'f', 'f']
            , 'grade': [11, 12, 10, 12, 8, 12, 10, 9]
            , 'gpa': [4.21, 3.82, 3.98, 4.30, 3.56, 4.11, 3.75, 3.88]
           }

In [21]:
dict_gpa

{'name': ['Bob', 'Sam', 'Jane', 'Kelly', 'Mark', 'Hannah', 'Mary', 'Erica'],
 'gender': ['m', 'm', 'f', 'f', 'm', 'f', 'f', 'f'],
 'grade': [11, 12, 10, 12, 8, 12, 10, 9],
 'gpa': [4.21, 3.82, 3.98, 4.3, 3.56, 4.11, 3.75, 3.88]}

In [22]:
gpa_dict_df = pd.DataFrame(dict_gpa)
gpa_dict_df

     name gender  grade   gpa
0     Bob      m     11  4.21
1     Sam      m     12  3.82
2    Jane      f     10  3.98
3   Kelly      f     12  4.30
4    Mark      m      8  3.56
5  Hannah      f     12  4.11
6    Mary      f     10  3.75
7   Erica      f      9  3.88

# Series

In [23]:
gpa_df.name

0       Bob
1       Sam
2      Jane
3     Kelly
4      Mark
5    Hannah
6      Mary
7     Erica
Name: name, dtype: object

In [24]:
gpa_df.columns

Index(['name', 'gender', 'grade', 'gpa'], dtype='object')

In [26]:
name_gender_df = gpa_df[['name', 'gender',]]
name_gender_df

     name gender
0     Bob      m
1     Sam      m
2    Jane      f
3   Kelly      f
4    Mark      m
5  Hannah      f
6    Mary      f
7   Erica      f